/*
Navicat MySQL Data Transfer

Source Server         : duan
Source Server Version : 50716
Source Host           : localhost:3306
Source Database       : great_web

Target Server Type    : MYSQL
Target Server Version : 50716
File Encoding         : 65001

Date: 2017-10-24 14:09:43
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `note`
-- ----------------------------
DROP TABLE IF EXISTS `note`;
CREATE TABLE `note` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(30) NOT NULL,
  `content` longtext,
  `datetime` bigint(20) DEFAULT NULL,
  `uid` int(11) DEFAULT NULL,
  `state` int(11) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `note_ibfk_1` (`uid`),
  CONSTRAINT `note_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=216 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of note
-- ----------------------------
INSERT INTO `note` VALUES ('107', '投诉建议', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507630921834', '3', '1');
INSERT INTO `note` VALUES ('109', '不如有用优雅的方式，看起来比较不失礼。', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507630921974', '5', '0');
INSERT INTO `note` VALUES ('112', '早已经散落天涯 3433', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。3', '1507630922099', '6', '0');
INSERT INTO `note` VALUES ('113', '玩法介绍', '青春就是疯狂的奔跑，然后华丽地跌倒。', '1507630922177', '2', '0');
INSERT INTO `note` VALUES ('114', '新手帮助', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507630922193', '5', '1');
INSERT INTO `note` VALUES ('116', '我们都是戏子', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507630922333', '4', '1');
INSERT INTO `note` VALUES ('118', '不如有用优雅的方式，看起来比较不失礼。', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507630922427', '4', '1');
INSERT INTO `note` VALUES ('119', '而我却不知道。', '你在乎，或者不在乎我，我就在角落，不来不去。', '1507630922489', '5', '1');
INSERT INTO `note` VALUES ('172', '不如有用优雅的方式，看起来比较不失礼。', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724434787', '4', '1');
INSERT INTO `note` VALUES ('173', '早已经散落天涯', '有人会因为你的缺陷而讨厌你，但是，也会有人因为你的真实天然而喜欢你。', '1507724434917', '4', '1');
INSERT INTO `note` VALUES ('174', '玩法介绍', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724434995', '6', '1');
INSERT INTO `note` VALUES ('175', '投诉建议', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724435458', '3', '1');
INSERT INTO `note` VALUES ('176', '寂寞横生', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724435538', '6', '1');
INSERT INTO `note` VALUES ('177', '投诉建议', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507724435566', '2', '1');
INSERT INTO `note` VALUES ('178', '早已经散落天涯', '有人会因为你的缺陷而讨厌你，但是，也会有人因为你的真实天然而喜欢你。', '1507724435645', '3', '1');
INSERT INTO `note` VALUES ('180', '投诉建议', '有人会因为你的缺陷而讨厌你，但是，也会有人因为你的真实天然而喜欢你。', '1507724435745', '6', '1');
INSERT INTO `note` VALUES ('181', '投诉建议', '青春就是疯狂的奔跑，然后华丽地跌倒。', '1507724435798', '3', '1');
INSERT INTO `note` VALUES ('182', '寂寞横生', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。', '1507724460655', '2', '1');
INSERT INTO `note` VALUES ('183', '我们都是戏子', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。', '1507724460742', '5', '1');
INSERT INTO `note` VALUES ('184', '玩法介绍', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724460812', '4', '1');
INSERT INTO `note` VALUES ('185', '早已经散落天涯', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。', '1507724460849', '5', '1');
INSERT INTO `note` VALUES ('186', '新手帮助', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507724462613', '6', '1');
INSERT INTO `note` VALUES ('187', '投诉建议', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。', '1507724462904', '3', '0');
INSERT INTO `note` VALUES ('188', '早已经散落天涯', '青春就是疯狂的奔跑，然后华丽地跌倒。', '1507724462933', '4', '0');
INSERT INTO `note` VALUES ('189', '早已经散落天涯112', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507724463024', '4', '0');
INSERT INTO `note` VALUES ('190', '玩法介绍11', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724463054', '5', '0');
INSERT INTO `note` VALUES ('191', '我们都是戏子', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724463128', '3', '0');
INSERT INTO `note` VALUES ('192', '不如有用优雅的方式，看起来比较不失礼。', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724557357', '4', '0');
INSERT INTO `note` VALUES ('193', '而我却不知道。', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724557498', '6', '0');
INSERT INTO `note` VALUES ('194', '玩法介绍', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724557560', '2', '0');
INSERT INTO `note` VALUES ('195', '不如有用优雅的方式，看起来比较不失礼。', '有人会因为你的缺陷而讨厌你，但是，也会有人因为你的真实天然而喜欢你。', '1507724557669', '5', '0');
INSERT INTO `note` VALUES ('196', '投诉建议', '老天在送你一个大礼物时，都会用重重困难做包装。', '1507724557816', '4', '0');
INSERT INTO `note` VALUES ('197', '我们都是戏子', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507724558029', '5', '0');
INSERT INTO `note` VALUES ('198', '寂寞横生', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724558638', '6', '0');
INSERT INTO `note` VALUES ('199', '投诉建议', '有人会因为你的缺陷而讨厌你，但是，也会有人因为你的真实天然而喜欢你。', '1507724558778', '6', '0');
INSERT INTO `note` VALUES ('200', '不如有用优雅的方式，看起来比较不失礼。', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724558856', '2', '0');
INSERT INTO `note` VALUES ('201', '新手帮助', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724558981', '2', '0');
INSERT INTO `note` VALUES ('202', '早已经散落天涯', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724559106', '5', '0');
INSERT INTO `note` VALUES ('203', '寂寞横生', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724559215', '4', '0');
INSERT INTO `note` VALUES ('204', '玩法介绍', '青春就是疯狂的奔跑，然后华丽地跌倒。', '1507724559293', '3', '0');
INSERT INTO `note` VALUES ('205', '寂寞横生', '跌跌撞撞才明白了许多，舍不得却又无可奈何。如果最后，陪在你身边的不是我，请不要怪我，因为我真的尽力了。与其脸红脖子的骂人，不如有用优雅的方式，看起来比较不失礼。我们都是戏子，在别人的故事里，流着自己的眼泪。', '1507724559324', '2', '0');
INSERT INTO `note` VALUES ('206', '早已经散落天涯', '有时候，坚持了你最不想干的事情之后，会得到你最想要的东西。', '1507724559402', '3', '0');
INSERT INTO `note` VALUES ('207', '投诉建议', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724559433', '2', '0');
INSERT INTO `note` VALUES ('208', '玩法介绍', '青春就是疯狂的奔跑，然后华丽地跌倒。', '1507724559496', '5', '0');
INSERT INTO `note` VALUES ('209', '投诉建议', '记忆是很任性的。你想记的可能都记不得，你想忘的可能都忘不掉。', '1507724559511', '4', '0');
INSERT INTO `note` VALUES ('210', '不如有用优雅的方式，看起来比较不失礼。', '能让内心保持宁静的人，才是最有力量的人。所谓“神静而心和，心和而形全;神躁则心荡，心荡则形伤。', '1507724559589', '6', '0');
INSERT INTO `note` VALUES ('212', '增条留言试试新', '新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试新增条留言试试', '1507795645340', '5', '0');
INSERT INTO `note` VALUES ('213', 'xczv', 'xczvxcxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvxczvzvxczvxczvxczv', '1507878341604', '5', '0');
INSERT INTO `note` VALUES ('214', '啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊', '111', '1507878341604', '4', '0');
INSERT INTO `note` VALUES ('215', 'testtitle', 'test', '1507878341604', '16', '0');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `password` varchar(30) NOT NULL,
  `state` int(11) NOT NULL DEFAULT '0',
  `age` int(11) NOT NULL DEFAULT '18',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', 'admin', '0', '18');
INSERT INTO `user` VALUES ('2', 'duan', 'duan', '0', '18');
INSERT INTO `user` VALUES ('3', 'jack', 'jack', '0', '18');
INSERT INTO `user` VALUES ('4', 'tom', 'tom', '0', '18');
INSERT INTO `user` VALUES ('5', 'DuanJN', 'Abcdef3', '0', '13');
INSERT INTO `user` VALUES ('6', 'admin_13', 'Abcdef2', '0', '55');
INSERT INTO `user` VALUES ('9', '李四', 'abcd_3A', '0', '13');
INSERT INTO `user` VALUES ('16', '六八', 'abcd_3A', '0', '13');
INSERT INTO `user` VALUES ('17', '七五', 'abcd_3A22', '1', '66');
